In [1]:
import pandas as pd
from datetime import datetime, timedelta

log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
#log=log[~log.user_id.str.contains('error',na=False)]
#log.user_id=log.user_id.apply(lambda x: x[24:])
log.time=log.time.str.replace('[', '')

In [40]:
display(log.info())
display(log.head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  1000 non-null   object
 1   time     985 non-null    object
 2   bet      485 non-null    float64
 3   win      138 non-null    float64
dtypes: float64(2), object(2)
memory usage: 31.4+ KB

None

                            user_id                 time  bet  win
0  Запись пользователя № - user_919  2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  2019-01-01 21:31:18  NaN  NaN

In [41]:
log.time.isna().sum()

15

In [30]:
df=log.drop_duplicates(subset=['user_id','time'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 986 entries, 0 to 995
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  986 non-null    object
 1   time     985 non-null    object
 2   bet      472 non-null    float64
 3   win      133 non-null    float64
dtypes: float64(2), object(2)
memory usage: 38.5+ KB

In [43]:
log.time=pd.to_datetime(log.time)
max_time=log.time.max()
datetime.strftime(max_time,'%Y-%m-%d')

'2019-04-20'

In [38]:
log = pd.read_csv("log.csv")  
log = log.dropna()  
log.columns = ['user_id', 'time', 'bet', 'win']  
log['time'] = log['time'].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time'])  
log['time'] = log['time'].apply(lambda x: x.minute)
log['time'].head()

13     57
28     59
150    54
188    34
204    26
Name: time, dtype: int64

In [47]:
log.time.dt.minute.value_counts()

36.0    25
31.0    23
6.0     22
50.0    22
14.0    21
29.0    21
12.0    21
5.0     21
40.0    21
18.0    21
43.0    21
53.0    21
58.0    20
57.0    20
45.0    20
48.0    20
2.0     20
21.0    19
56.0    19
27.0    19
9.0     18
54.0    18
47.0    18
20.0    18
34.0    18
35.0    18
3.0     18
33.0    18
51.0    17
10.0    17
55.0    16
25.0    16
17.0    16
49.0    15
28.0    15
24.0    15
30.0    15
38.0    15
15.0    15
37.0    15
16.0    15
7.0     14
4.0     14
44.0    14
19.0    14
32.0    14
59.0    13
41.0    13
1.0     13
0.0     12
23.0    12
39.0    12
22.0    11
13.0    11
42.0    11
52.0    10
46.0    10
8.0      9
26.0     9
11.0     6
Name: time, dtype: int64

In [48]:
log.time.dt.month.value_counts(ascending=True)

4.0    170
2.0    259
3.0    264
1.0    292
Name: time, dtype: int64

In [65]:
#11.4
log[(log.time.dt.dayofweek==5) | (log.time.dt.dayofweek==6)].time

39    2019-01-05 01:54:07
40    2019-01-05 10:44:56
41    2019-01-05 13:13:21
42    2019-01-05 14:36:15
43    2019-01-05 18:09:15
              ...
991   2019-04-20 12:55:41
992   2019-04-20 14:59:36
993   2019-04-20 17:09:56
994   2019-04-20 18:10:07
995   2019-04-20 09:59:58
Name: time, Length: 283, dtype: datetime64[ns]

In [122]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log = log.dropna(axis=0, subset=['time'])
log.time=log.time.str.replace('[', '')
log['time'] = pd.to_datetime(log['time'])    
log['day']=log.time.apply(lambda x:x.hour) 
log.head()

                            user_id                time  bet  win  day
0  Запись пользователя № - user_919 2019-01-01 14:06:51  NaN  NaN   14
1  Запись пользователя № - user_973 2019-01-01 14:51:16  NaN  NaN   14
2  Запись пользователя № - user_903 2019-01-01 16:31:16  NaN  NaN   16
3  Запись пользователя № - user_954 2019-01-01 17:17:51  NaN  NaN   17
4  Запись пользователя № - user_954 2019-01-01 21:31:18  NaN  NaN   21

In [128]:
def daytime(x):
    if x<6: return 'ночь'
    if x<=12: return 'утро'
    if x<=18: return 'день'
    if x<=24: return 'вечер'
    return x

In [130]:
log.day.apply(daytime).value_counts()

утро     295
ночь     265
день     240
вечер    185
Name: day, dtype: int64

In [132]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log = log.dropna()
log.time=log.time.str.replace('[', '')
log['time'] = pd.to_datetime(log['time'])   
log['hour']=log.time.apply(lambda x:x.hour) 
log.head()

,user_id,time,bet,win,hour
14,Запись пользователя № - user_917,2019-01-02 08:57:36,145732.0,1987653.0,8
29,Запись пользователя № - user_942,2019-01-04 13:59:42,1678321.0,9876543.0,13
151,Запись пользователя № - user_982,2019-01-16 21:54:22,100.0,4749.0,21
189,Запись пользователя № - user_964,2019-01-21 18:34:44,200.0,4667.0,18
205,Запись пользователя № - user_931,2019-01-22 05:26:59,300.0,4319.0,5

In [135]:
#11.5
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log['bet'].fillna(0).value_counts()

0.0          515
500.0         50
100.0         48
300.0         42
800.0         42
200.0         40
400.0         40
700.0         38
600.0         37
1000.0        37
900.0         30
9754.0        10
10554.0       10
10154.0        7
10254.0        7
10454.0        6
9954.0         6
10754.0        5
10654.0        5
10354.0        4
10054.0        4
9854.0         2
5000.0         1
27000.0        1
9876.0         1
156789.0       1
12945.0        1
12548.0        1
145732.0       1
1678321.0      1
98753.0        1
123981.0       1
104540.0       1
8700.0         1
950.0          1
8734.0         1
7650.0         1
Name: bet, dtype: int64

In [5]:
def fillna_win(row):  
    if row.win!=0: return row.win 
    elif row.win==0 and row.bet!=0: return 0-row.bet
    return 0
# Применяем функцию  
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log.fillna(0,inplace=True) 
new_win = log.apply(lambda row: fillna_win(row), axis=1)  
  
# Заменяем старый столбец с пропусками на новый без пропусков  
log['win'] = new_win 
(log.win<0).sum()

347

In [7]:
def net(x):
    if x.win<0: return x.win
    else: return x.win-x.bet

log['net']=log.apply(lambda x:net(x),axis=1)
(log.net>0).sum()

133

In [162]:
display(log[log.net>0].net.mean())
display(log[log.net>0].net.median())

80253.33333333333

5347.0

In [169]:
#11.7
(log.bet>0).sum()/1000

0.485

In [170]:
log[log.bet>0].bet.mean()

6785.738144329897

In [171]:
log[log.bet>0].net.mean()

20421.892783505155

In [172]:
log[log.net<0].net.mean()

-3372.743515850144

In [173]:
display((log.net>0).sum()/(log.bet>0).sum())

0.2845360824742268

In [175]:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
min_bet_amount=(log.bet==log.bet.min()).sum()
min_bet_amount

48

In [8]:
#11.8
users=pd.read_csv('users.csv',encoding='koi8_r',sep='\t')
users.columns=['user_id','email','geo']
users.user_id = users.user_id.apply(lambda x: x.lower())  


log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log = log[log.user_id != '#error']
log.time=log.time.str.replace('[', '')
log['time'] = pd.to_datetime(log['time'])
log.user_id = log.user_id.str.split(' - ').apply(lambda x: x[1])
log.fillna(0,inplace=True) 
new_win = log.apply(lambda row: fillna_win(row), axis=1)
log['win'] = new_win 
log['net']=log.apply(lambda x:net(x),axis=1)
log.head()

    user_id                time  bet  win  net
0  user_919 2019-01-01 14:06:51  0.0  0.0  0.0
1  user_973 2019-01-01 14:51:16  0.0  0.0  0.0
2  user_903 2019-01-01 16:31:16  0.0  0.0  0.0
3  user_954 2019-01-01 17:17:51  0.0  0.0  0.0
4  user_954 2019-01-01 21:31:18  0.0  0.0  0.0

In [9]:
df=pd.merge(users,log,on='user_id')

In [184]:
df.user_id.value_counts()

user_966    18
user_972    16
user_973    15
user_937    15
user_983    15
            ..
user_945     5
user_932     5
user_915     5
user_996     5
user_921     4
Name: user_id, Length: 100, dtype: int64

In [13]:
#11.9
df.groupby('user_id').net.sum().median()

1986.0

In [14]:
#11.10
df.head()

,user_id,email,geo,time,bet,win,net
0,user_943,Accumanst@gmail.com,Ижевск,2019-01-06 21:06:57,0.0,0.0,0.0
1,user_943,Accumanst@gmail.com,Ижевск,2019-01-10 12:16:22,100.0,-100.0,-100.0
2,user_943,Accumanst@gmail.com,Ижевск,2019-01-27 01:18:47,100.0,-100.0,-100.0
3,user_943,Accumanst@gmail.com,Ижевск,2019-02-10 11:09:24,100.0,5456.0,5356.0
4,user_943,Accumanst@gmail.com,Ижевск,2019-02-12 15:09:38,300.0,5245.0,4945.0

In [21]:
dm=df.groupby('geo').sum().win.sort_values(ascending=False)
dm

geo
Москва             11379755.0
Воронеж              107514.0
Санкт-Петербург      105345.0
Казань                75352.0
Ярославль             46845.0
Ижевск                34479.0
Хабаровск             33451.0
Екатеринбург          28582.0
Красноярск            27397.0
Арзангелтск           25813.0
Пермь                 19518.0
Краснодар              3248.0
Ставрополь              487.0
Тюмень                 -499.0
Name: win, dtype: float64

In [35]:
dm=df[df.bet>0]
dm=dm.groupby('geo').mean()
dm.bet.max()/dm.bet.min()

127.81602335164835

In [38]:
users=pd.read_csv('users.csv',encoding='koi8_r',sep='\t')
users.columns=['user_id','email','geo']
users.user_id = users.user_id.apply(lambda x: x.lower())  


log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
log = log[log.user_id != '#error']
log.time=log.time.str.replace('[', '')
log['time'] = pd.to_datetime(log['time'])
log.user_id = log.user_id.str.split(' - ').apply(lambda x: x[1])
dl=pd.merge(users,log,on='user_id')
dl.groupby('geo').user_id.count()

geo
Арзангелтск         96
Воронеж             88
Екатеринбург        49
Ижевск              61
Казань              66
Краснодар           86
Красноярск          56
Москва              61
Пермь               55
Санкт-Петербург    115
Ставрополь          36
Тюмень              32
Хабаровск           60
Ярославль           89
Name: user_id, dtype: int64

In [42]:
log['time'].apply(lambda pandas_dataframe: pandas_dataframe.month)

0      1
1      1
2      1
3      1
4      1
      ..
991    4
992    4
993    4
994    4
995    4
Name: time, Length: 985, dtype: int64